#+TITLE: Case Study Webtechnologien
#+SETUPFILE: ~/git_repos/notes/settings/html_theme/setup/theme-readtheorg.setup
#+AUTHOR: Ivan Hörler Andreas Zweili
#+LaTeX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,11pt]
#+LaTeX_HEADER: \input{style}
#+OPTIONS: H:5 todo:t
#+LANGUAGE: de
#+STARTUP: align


*** ASP.NET und SQL Server

ASP.NET und SQL Server, Tabelle:([[tab:asp-net]]), haben vor allem viele
Punkte verloren, da C# nur in Teilen und SQL Server gar nicht unter
einer freien Lizenz steht. Des weiteren läuft .NET Core zwar auch auf
Unix Systemen, allerdings ist das verhältnismässig ein relativ kleiner
Teil der gesamten Sprache. SQL Server läuft hingegen nur unter Windows
und Linux. Des weiteren ist es sehr schwierig C# Applikationen ohne
Visual Studio zu entwickeln. Es geht in der Theorie, in der Praxis ist
es jedoch eher umständlich. Die Vorkenntnisse wurden mit 6 von 10
Punkten bewertet, da wir C# zwar im Rahmen der Ausbildung lernen,
allerdings noch nicht das Gefühl haben sonderlich gut mit C# umgehen
zu können.

#+CAPTION: Bewertung der Variante ASP.NET und SQL Server
#+ATTR_LATEX: :align |>{\columncolor[HTML]{EFEFEF}}p{4cm}|c|p{2cm}|p{2cm}|p{2cm}|
#+NAME: tab:asp-net
|----------------------+----------------------+----------------------+----------------------+----------------------|
| <20>                 |                 <20> |                 <20> |                 <20> |                 <20> |
| *Kriterium*\cellcolor[HTML]{C0C0C0} | *Gewichtung*\cellcolor[HTML]{C0C0C0} | *max. Punktzahl*\cellcolor[HTML]{C0C0C0} | *erreichte Punktzahl*\cellcolor[HTML]{C0C0C0} | *Kriteriums- ergebnis*\cellcolor[HTML]{C0C0C0} |
|----------------------+----------------------+----------------------+----------------------+----------------------|
| Freie Software       |                    5 |                   10 |                    5 |                   25 |
| Cross Plattform nutzbar |                    5 |                   10 |                    6 |                   30 |
| Lesbarkeit des Codes |                    5 |                    5 |                    4 |                   20 |
| Einfachheit des Setups |                    3 |                    5 |                    5 |                   15 |
| Ohne spezielle Tools nutzbar |                    3 |                    5 |                    1 |                    3 |
| Vorkenntnisse        |                    3 |                   10 |                    6 |                   18 |
| Lernfaktor           |                    5 |                   10 |                    6 |                   30 |
|----------------------+----------------------+----------------------+----------------------+----------------------|
| *Total*              |                      |                      |                      |                  141 |
|----------------------+----------------------+----------------------+----------------------+----------------------|
#+TBLFM: @3$5=@3$2 * @3$4::@4$5=@4$2 * @4$4::@5$5=@5$2 * @5$4::@6$5=@6$2 * @6$4::@7$5=@7$2 * @7$4::@8$5=@8$2 * @8$4
#+TBLFM: @9$5=@9$2 * @9$4
#+TBLFM: @10$5=vsum(@3$5..@9$5)

*** PHP und MySQL

Die Variante PHP und MySQL, Tabelle:([[tab:php]]), hat insgesamt eine sehr
gute Bewertung erhalten. Beide Projekte sind zumindest teilweise unter
einer freien Lizenz verfügbar und sind sowohl unter Windows, wie auch
Mac und Linux einsetzbar. Allerdings gibt es von MySQL noch eine
proprietäre Enterprise Variante, weshalb wir hier nicht die volle
Punktzahl vergeben konnten. Abstriche gab es bei der Lesbarkeit des
Codes. Da PHP insgesamt eine ziemlich inkonsistente und ausschweifende
Sprache ist. Dafür ist das Setup sehr einfach und man kann eine PHP
basierte Applikation ohne spezielle Werkzeuge entwickeln. Da wir
jedoch bereits sehr intensiv mit PHP und MySQL in Berührung kamen, haben
wir beim Lernfaktor Abstriche gemacht. In Zusammenhang mit einem
Framework hätten wir sicher auch viel dazugelernt. Im Vergleich zu den
anderen Varianten jedoch auf jeden Fall weniger.

#+CAPTION: Bewertung der Variante PHP und MySQL
#+ATTR_LATEX: :align |>{\columncolor[HTML]{EFEFEF}}p{4cm}|c|p{2cm}|p{2cm}|p{2cm}|
#+NAME: tab:php
|----------------------+----------------------+----------------------+----------------------+----------------------|
| <20>                 |                 <20> |                 <20> |                 <20> |                 <20> |
| *Kriterium*\cellcolor[HTML]{C0C0C0} | *Gewichtung*\cellcolor[HTML]{C0C0C0} | *max. Punktzahl*\cellcolor[HTML]{C0C0C0} | *erreichte Punktzahl*\cellcolor[HTML]{C0C0C0} | *Kriteriums- ergebnis*\cellcolor[HTML]{C0C0C0} |
|----------------------+----------------------+----------------------+----------------------+----------------------|
| Freie Software       |                    5 |                   10 |                    8 |                   40 |
| Cross Plattform nutzbar |                    5 |                   10 |                    8 |                   40 |
| Lesbarkeit des Codes |                    5 |                    5 |                    2 |                   10 |
| Einfachheit des Setups |                    3 |                    5 |                    5 |                   15 |
| Ohne spezielle Tools nutzbar |                    3 |                    5 |                    5 |                   15 |
| Vorkenntnisse        |                    3 |                   10 |                    7 |                   21 |
| Lernfaktor           |                    5 |                   10 |                    4 |                   20 |
|----------------------+----------------------+----------------------+----------------------+----------------------|
| *Total*              |                      |                      |                      |                  161 |
|----------------------+----------------------+----------------------+----------------------+----------------------|
#+TBLFM: @3$5=@3$2 * @3$4::@4$5=@4$2 * @4$4::@5$5=@5$2 * @5$4::@6$5=@6$2 * @6$4::@7$5=@7$2 * @7$4::@8$5=@8$2 * @8$4
#+TBLFM: @9$5=@9$2 * @9$4
#+TBLFM: @10$5=vsum(@3$5..@9$5)

*** Django(Python) und MariaDB

Diese Variante, Tabelle:([[tab:django]]), hat am meisten Punkte erhalten.
Wie bei der Variante "PHP und MySQL" sind auch hier beide Komponenten
freie Software. Im Gegensatz zu der vorherigen Variante gibt es bei
diesen Komponenten nur eine mögliche Lizenzform. Womit sie die volle
Punktzahl in dieser Kategorie erreichten.

Beide Projekte laufen unter Windows, Linux sowie Mac. Wobei das Setup
für Django(Python) unter Windows etwas komplizierter ausfällt
als wir gerne hätten, weshalb wir hier bei der Cross Plattform
Kompatibilität und dem Setup einen Abstrich gemacht haben. Python kann
ohne spezielle Tools programmiert werden und gilt als eine der
Sprachen mit der leserlichsten Syntax. Die Vorkenntnisse haben wir hier
als eher niedrig eingestuft dafür den Lernfaktor umso höher.

#+CAPTION: Bewertung der Variante Django und MariaDB
#+ATTR_LATEX: :align |>{\columncolor[HTML]{EFEFEF}}p{4cm}|c|p{2cm}|p{2cm}|p{2cm}|
#+NAME: tab:django
|----------------------+----------------------+----------------------+----------------------+----------------------|
| <20>                 |                 <20> |                 <20> |                 <20> |                 <20> |
| *Kriterium*\cellcolor[HTML]{C0C0C0} | *Gewichtung*\cellcolor[HTML]{C0C0C0} | *max. Punktzahl*\cellcolor[HTML]{C0C0C0} | *erreichte Punktzahl*\cellcolor[HTML]{C0C0C0} | *Kriteriums- ergebnis*\cellcolor[HTML]{C0C0C0} |
|----------------------+----------------------+----------------------+----------------------+----------------------|
| Freie Software       |                    5 |                   10 |                   10 |                   50 |
| Cross Plattform nutzbar |                    5 |                   10 |                    9 |                   45 |
| Lesbarkeit des Codes |                    5 |                    5 |                    5 |                   25 |
| Einfachheit des Setups |                    3 |                    5 |                    3 |                    9 |
| Ohne spezielle Tools nutzbar |                    3 |                    5 |                    5 |                   15 |
| Vorkenntnisse        |                    3 |                   10 |                    4 |                   12 |
| Lernfaktor           |                    5 |                   10 |                    8 |                   40 |
|----------------------+----------------------+----------------------+----------------------+----------------------|
| *Total*              |                      |                      |                      |                  196 |
|----------------------+----------------------+----------------------+----------------------+----------------------|
#+TBLFM: @3$5=@3$2 * @3$4::@4$5=@4$2 * @4$4::@5$5=@5$2 * @5$4::@6$5=@6$2 * @6$4::@7$5=@7$2 * @7$4::@8$5=@8$2 * @8$4
#+TBLFM: @9$5=@9$2 * @9$4
#+TBLFM: @10$5=vsum(@3$5..@9$5)

** Arbeitspakete definieren

#+CAPTION: Variantenbewertung Ergebnis
#+ATTR_LATEX: :environment longtable :align |r|l|l|l|r|r|
|------------------------------+----------------------------------------------------+--------------------------------+----------------------------------+------------------------------------------+--------------------------------------|
| *ID*\cellcolor[HTML]{C0C0C0} | *Subject*\cellcolor[HTML]{C0C0C0}                  | *Type*\cellcolor[HTML]{C0C0C0} | *Status*\cellcolor[HTML]{C0C0C0} | *Estimated time*\cellcolor[HTML]{C0C0C0} | *Spent time*\cellcolor[HTML]{C0C0C0} |
|------------------------------+----------------------------------------------------+--------------------------------+----------------------------------+------------------------------------------+--------------------------------------|
|                          201 | Projektanalyse und Planung                         | Phase                          | Closed                           |                                     25.5 |                                 30.5 |
|                          202 | Projektziele                                       | Task                           | Closed                           |                                        1 |                                  0.5 |
|                          203 | Vision                                             | Task                           | Closed                           |                                        1 |                                  0.5 |
|                          204 | SWOT-Analyse                                       | Task                           | Closed                           |                                        3 |                                  0.5 |
|                          205 | Umweltanalyse                                      | Task                           | Closed                           |                                        3 |                                  1.5 |
|                          206 | Risikomanagement                                   | Task                           | Closed                           |                                        2 |                                  2.5 |
|                          207 | Projektabgrenzung                                  | Task                           | Closed                           |                                        2 |                                    2 |
|                          259 | Meeting 1                                          | Milestone                      | Closed                           |                                        3 |                                    6 |
|                          200 | Kickoff                                            | Milestone                      | Closed                           |                                        4 |                                    8 |
|                          301 | Meeting 2                                          | Milestone                      | Closed                           |                                        3 |                                    3 |
|                          306 | Meeting 3                                          | Milestone                      | Closed                           |                                      1.5 |                                    3 |
|                          313 | Meeting 4                                          | Milestone                      | Closed                           |                                        1 |                                    1 |
|                          314 | Meeting 5                                          | Milestone                      | Closed                           |                                        1 |                                    1 |
|                          208 | Projektmanagement                                  | Phase                          | Closed                           |                                       39 |                                   30 |
|                          218 | Architektur vorbereiten                            | Phase                          | Closed                           |                                       33 |                                   27 |
|                          219 | Architektur Grafik                                 | Task                           | Closed                           |                                        6 |                                    4 |
|                          220 | Use Case Grafiken                                  | Task                           | Closed                           |                                        6 |                                    3 |
|                          221 | User Stories                                       | Task                           | Closed                           |                                        1 |                                    1 |
|                          310 | Use Case Beschreibungen                            | Task                           | Closed                           |                                       10 |                                    9 |
|                          254 | Test Cases benennen                                | Task                           | Closed                           |                                       10 |                                   10 |
|                          222 | Organigramm                                        | Task                           | Closed                           |                                      0.5 |                                  0.5 |
|                          223 | Projektstrukturplan                                | Task                           | Closed                           |                                      1.5 |                                  1.5 |
|                          224 | Arbeitspakete definieren                           | Task                           | Closed                           |                                        4 |                                    1 |
|                          225 | Datenbank                                          | Phase                          | Closed                           |                                     23.5 |                                13.65 |
|                          226 | Anforderungsanalyse                                | Task                           | Closed                           |                                      0.5 |                                    0 |
|                          227 | Relationen Model                                   | Task                           | Closed                           |                                        2 |                                  0.5 |
|                          228 | Relationen Diagramm                                | Task                           | Closed                           |                                        4 |                                 5.25 |
|                          229 | SQL Create DB                                      | Task                           | Closed                           |                                      0.5 |                                  0.5 |
|                          230 | SQL Insert Testdaten                               | Task                           | Closed                           |                                       10 |                                    7 |
|                          231 | SQL Restriktionen erarbeiten                       | Task                           | Rejected                         |                                      0.5 |                                  0.1 |
|                          232 | SQL Views erstellen                                | Task                           | Rejected                         |                                        2 |                                  0.1 |
|                          233 | SQL Prozeduren und Funktionen erarbeiten           | Task                           | Rejected                         |                                        2 |                                  0.1 |
|                          304 | SQL Create Tables                                  | Task                           | Rejected                         |                                        2 |                                  0.1 |
|                          234 | Benutzerinterface                                  | Phase                          | Closed                           |                                     44.5 |                                   58 |
|                          235 | Mockup skizzieren                                  | Task                           | Closed                           |                                        1 |                                    1 |
|                          236 | Frontend Umsetzung                                 | Phase                          | Closed                           |                                     15.5 |                                   25 |
|                          237 | Login                                              | Task                           | Closed                           |                                      0.5 |                                 2.75 |
|                          315 | BUG: Eine zu lange Strassenummer wirf einen Fehler | Task                           | Closed                           |                                      0.5 |                                 0.25 |
|                          238 | Artikel                                            | Task                           | Closed                           |                                          |                                 0.25 |
|                          312 | BUG, Preise können negativ sein.                   | Task                           | Closed                           |                                          |                                 0.25 |
|                          239 | Artikelliste                                       | Task                           | Closed                           |                                        5 |                                    5 |
|                          240 | Warenkorb                                          | Task                           | Closed                           |                                        5 |                                   12 |
|                          241 | Checkout                                           | Task                           | Closed                           |                                        5 |                                    5 |
|                          242 | Backend Umsetzung                                  | Phase                          | Closed                           |                                       28 |                                   32 |
|                          243 | Login                                              | Task                           | Closed                           |                                        5 |                                    5 |
|                          244 | Artikel                                            | Task                           | Closed                           |                                        5 |                                    1 |
|                          247 | Artikelliste                                       | Task                           | Closed                           |                                      2.5 |                                  0.5 |
|                          302 | Artikel Erstellung                                 | Task                           | Closed                           |                                      2.5 |                                  0.5 |
|                          245 | Kategorien                                         | Task                           | Closed                           |                                        5 |                                    1 |
|                          248 | Kategorie Liste                                    | Task                           | Closed                           |                                      2.5 |                                  0.5 |
|                          303 | Kategorie erstellen                                | Task                           | Closed                           |                                      2.5 |                                  0.5 |
|                          246 | Artikel Attributte                                 | Task                           | Closed                           |                                        4 |                                  1.5 |
|                          249 | Atributt Liste                                     | Task                           | Rejected                         |                                        1 |                                    0 |
|                          305 | Bilder hochladen                                   | Task                           | Closed                           |                                        3 |                                  1.5 |
|                          250 | Kunden Liste                                       | Task                           | Closed                           |                                        1 |                                  0.5 |
|                          308 | Models                                             | Task                           | Closed                           |                                        3 |                                    5 |
|                          309 | Währungskurse                                      | Task                           | Closed                           |                                        5 |                                   18 |
|                          252 | Testing                                            | Phase                          | Closed                           |                                       10 |                                   10 |
|                          255 | Test Cases Durchführung                            | Task                           | Closed                           |                                       10 |                                   10 |
|                          257 | Dokumentations Styling                             | Task                           | Closed                           |                                        2 |                                  2.5 |
|                          258 | Präsentation                                       | Milestone                      | In progress                      |                                        2 |                                    0 |
|                          263 | Vorprojekt                                         | Task                           | Closed                           |                                    28.25 |                                 35.5 |
|                          209 | Tools vorbereiten                                  | Phase                          | Closed                           |                                     4.75 |                                   12 |
|                          210 | GIT-Workspace                                      | Task                           | Closed                           |                                      0.5 |                                  0.5 |
|                          211 | Development Container                              | Task                           | Closed                           |                                        2 |                                 7.25 |
|                          261 | Domain reservieren                                 | Task                           | Closed                           |                                     0.25 |                                 0.25 |
|                          262 | Produktions Server aufsetzen                       | Task                           | Closed                           |                                        2 |                                    4 |
|                          212 | Technologien abklären                              | Phase                          | Closed                           |                                     13.5 |                                 13.5 |
|                          213 | C#                                                 | Task                           | Closed                           |                                        1 |                                    1 |
|                          214 | Django                                             | Task                           | Closed                           |                                        5 |                                    5 |
|                          215 | MariaDB                                            | Task                           | Closed                           |                                      0.5 |                                  0.5 |
|                          216 | SQL Server                                         | Task                           | Closed                           |                                        1 |                                    1 |
|                          217 | Laravel                                            | Task                           | Closed                           |                                        5 |                                    5 |
|                          316 | MySQL                                              | Task                           | Closed                           |                                        1 |                                    1 |
|                          264 | Architektur Tests                                  | Task                           | Closed                           |                                        6 |                                    6 |
|                          307 | Machbarkeitsanalyse                                | Task                           | Closed                           |                                        2 |                                    2 |
|                          251 | Varianten Erarbeiten                               | Task                           | Closed                           |                                        2 |                                    2 |
|                          265 | Abgabetermin                                       | Milestone                      | Scheduled                        |                                      0.5 |                                    0 |
|                          266 | Zwischenbericht ablieferen                         | Task                           | Closed                           |                                      0.5 |                                    0 |
|------------------------------+----------------------------------------------------+--------------------------------+----------------------------------+------------------------------------------+--------------------------------------|
|                      *Total* |                                                    |                                |                                  |                                   455.75 |                               470.30 |
|------------------------------+----------------------------------------------------+--------------------------------+----------------------------------+------------------------------------------+--------------------------------------|
#+TBLFM: @>$5=vsum(@2..@-1);%.2f
#+TBLFM: @>$6=vsum(@2..@-1);%.2f
#+LATEX:\end{landscape}

